<a href="https://colab.research.google.com/github/dpaggiola/machinelearning/blob/main/PruebaInicial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Cuaderno de prueba

In [4]:
# Importar librerias
import numpy as np
import pandas as pd
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats.mstats import winsorize
from google.colab import drive, files
import io

In [5]:
# Carga de los datos (desde drive)
drive.mount('/content/drive', force_remount=True)

df=pd.read_csv("/content/drive/My Drive/data/credit_data.csv", sep = ",")

Mounted at /content/drive

In [6]:
df

     Age      Sex  Job  ... Duration                       Purpose  Risk
0     67    male     1  ...        6           domestic appliances  good
1     22  female     1  ...       48           domestic appliances   bad
2     49    male     3  ...       12  (vacation - does not exist?)  good
3     45    male     1  ...       42              radio/television  good
4     53    male     1  ...       24                     car (new)   bad
..   ...      ...  ...  ...      ...                           ...   ...
995   31  female     3  ...       12              radio/television  good
996   40    male     0  ...       30                    car (used)  good
997   38    male     1  ...       12           domestic appliances  good
998   23    male     1  ...       45           domestic appliances   bad
999   27    male     1  ...       45                    car (used)  good

[1000 rows x 10 columns]

In [7]:
df.shape

(1000, 10)

In [8]:
df.describe

<bound method NDFrame.describe of      Age      Sex  Job  ... Duration                       Purpose  Risk
0     67    male     1  ...        6           domestic appliances  good
1     22  female     1  ...       48           domestic appliances   bad
2     49    male     3  ...       12  (vacation - does not exist?)  good
3     45    male     1  ...       42              radio/television  good
4     53    male     1  ...       24                     car (new)   bad
..   ...      ...  ...  ...      ...                           ...   ...
995   31  female     3  ...       12              radio/television  good
996   40    male     0  ...       30                    car (used)  good
997   38    male     1  ...       12           domestic appliances  good
998   23    male     1  ...       45           domestic appliances   bad
999   27    male     1  ...       45                    car (used)  good

[1000 rows x 10 columns]>

In [9]:
df.values

array([[67, 'male ', 1, ..., 6, 'domestic appliances', 'good'],
       [22, 'female ', 1, ..., 48, 'domestic appliances', 'bad'],
       [49, 'male ', 3, ..., 12, '(vacation - does not exist?)', 'good'],
       ...,
       [38, 'male ', 1, ..., 12, 'domestic appliances', 'good'],
       [23, 'male ', 1, ..., 45, 'domestic appliances', 'bad'],
       [27, 'male ', 1, ..., 45, 'car (used)', 'good']], dtype=object)

In [12]:
df.drop(columns=['Sex', 'Duration'])

     Age  Job   Housing  ... Credit amount                       Purpose  Risk
0     67    1       own  ...          1169           domestic appliances  good
1     22    1       own  ...          5951           domestic appliances   bad
2     49    3       own  ...          2096  (vacation - does not exist?)  good
3     45    1  for free  ...          7882              radio/television  good
4     53    1  for free  ...          4870                     car (new)   bad
..   ...  ...       ...  ...           ...                           ...   ...
995   31    3       own  ...          1736              radio/television  good
996   40    0       own  ...          3857                    car (used)  good
997   38    1       own  ...           804           domestic appliances  good
998   23    1  for free  ...          1845           domestic appliances   bad
999   27    1       own  ...          4576                    car (used)  good

[1000 rows x 8 columns]

In [13]:
df

     Age      Sex  Job  ... Duration                       Purpose  Risk
0     67    male     1  ...        6           domestic appliances  good
1     22  female     1  ...       48           domestic appliances   bad
2     49    male     3  ...       12  (vacation - does not exist?)  good
3     45    male     1  ...       42              radio/television  good
4     53    male     1  ...       24                     car (new)   bad
..   ...      ...  ...  ...      ...                           ...   ...
995   31  female     3  ...       12              radio/television  good
996   40    male     0  ...       30                    car (used)  good
997   38    male     1  ...       12           domestic appliances  good
998   23    male     1  ...       45           domestic appliances   bad
999   27    male     1  ...       45                    car (used)  good

[1000 rows x 10 columns]

In [14]:
nuevo_df = df[['Age', 'Sex']]
nuevo_df

     Age      Sex
0     67    male
1     22  female
2     49    male
3     45    male
4     53    male
..   ...      ...
995   31  female
996   40    male
997   38    male
998   23    male
999   27    male

[1000 rows x 2 columns]

In [20]:
nuevo_df["treintaniero"] = nuevo_df['Age'] > 29
nuevo_df

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

     Age      Sex  treintaniero
0     67    male           True
1     22  female          False
2     49    male           True
3     45    male           True
4     53    male           True
..   ...      ...           ...
995   31  female           True
996   40    male           True
997   38    male           True
998   23    male          False
999   27    male          False

[1000 rows x 3 columns]

In [21]:
len(nuevo_df)

1000

In [22]:
len(nuevo_df.index)

1000

In [24]:
nuevo_df.mean

<bound method DataFrame.mean of      Age      Sex  treintaniero
0     67    male           True
1     22  female          False
2     49    male           True
3     45    male           True
4     53    male           True
..   ...      ...           ...
995   31  female           True
996   40    male           True
997   38    male           True
998   23    male          False
999   27    male          False

[1000 rows x 3 columns]>

In [25]:
nuevo_df.corr

<bound method DataFrame.corr of      Age      Sex  treintaniero
0     67    male           True
1     22  female          False
2     49    male           True
3     45    male           True
4     53    male           True
..   ...      ...           ...
995   31  female           True
996   40    male           True
997   38    male           True
998   23    male          False
999   27    male          False

[1000 rows x 3 columns]>

In [26]:
print('Números no nulos')
nuevo_df.count

Números no nulos

<bound method DataFrame.count of      Age      Sex  treintaniero
0     67    male           True
1     22  female          False
2     49    male           True
3     45    male           True
4     53    male           True
..   ...      ...           ...
995   31  female           True
996   40    male           True
997   38    male           True
998   23    male          False
999   27    male          False

[1000 rows x 3 columns]>

In [30]:
df.iloc[0]

Age                                  67
Sex                               male
Job                                   1
Housing                             own
Saving accounts                     NaN
Checking account                 little
Credit amount                      1169
Duration                              6
Purpose             domestic appliances
Risk                               good
Name: 0, dtype: object

In [33]:
df.iloc[0][0]

67

In [34]:
df.loc[0]

Age                                  67
Sex                               male
Job                                   1
Housing                             own
Saving accounts                     NaN
Checking account                 little
Credit amount                      1169
Duration                              6
Purpose             domestic appliances
Risk                               good
Name: 0, dtype: object

In [39]:
df.isnull().sum

<bound method DataFrame.sum of        Age    Sex    Job  Housing  ...  Credit amount  Duration  Purpose   Risk
0    False  False  False    False  ...          False     False    False  False
1    False  False  False    False  ...          False     False    False  False
2    False  False  False    False  ...          False     False    False  False
3    False  False  False    False  ...          False     False    False  False
4    False  False  False    False  ...          False     False    False  False
..     ...    ...    ...      ...  ...            ...       ...      ...    ...
995  False  False  False    False  ...          False     False    False  False
996  False  False  False    False  ...          False     False    False  False
997  False  False  False    False  ...          False     False    False  False
998  False  False  False    False  ...          False     False    False  False
999  False  False  False    False  ...          False     False    False  False

[1000 rows x 10 columns]>